src/main/resources/templates/cso-save-filing.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cso="http://csoextws.jag.gov.bc.ca/">
    <soapenv:Header/>
    <soapenv:Body>
        <cso:saveFiling>
            <userguid>?</userguid>
            <bcolUserId>?</bcolUserId>
            <bcolSessionKey>?</bcolSessionKey>
            <bcolUniqueId>?</bcolUniqueId>
            <efilingPackage>
                <cfcsa>?</cfcsa>
                <classCd>?</classCd>
                <clientRefNo>?</clientRefNo>
                <comments>?</comments>
                <courtFileNumber>?</courtFileNumber>
                <divisionCd>?</divisionCd>
                <documents>
                    <objectGUID>?</objectGUID>
                    <documentDescriptionTxt>?</documentDescriptionTxt>
                    <documentStatusTypeCd>?</documentStatusTypeCd>
                    <documentSubTypeCd>?</documentSubTypeCd>
                    <documentTypeCd>?</documentTypeCd>
                    <feeExempt>?</feeExempt>
                    <filenameTxt>?</filenameTxt>
                    <initiating>?</initiating>
                    <orderDocument>?</orderDocument>
                    <statusDtm>?</statusDtm>
                    <uploadStateCd>?</uploadStateCd>
                    <uploadedToApplicationCd>?</uploadedToApplicationCd>
                </documents>
                <existingFile>?</existingFile>
                <indigent>?</indigent>
                <invoiceNo>?</invoiceNo>
                <levelCd>?</levelCd>
                <locationCd>?</locationCd>
                <notificationEmail>?</notificationEmail>
                <parties>
                    <firstGivenName>?</firstGivenName>
                    <organizationName>?</organizationName>
                    <partyType>?</partyType>
                    <roleType>?</roleType>
                    <secondGivenName>?</secondGivenName>
                    <surnameName>?</surnameName>
                    <thirdGivenName>?</thirdGivenName>
                </parties>
                <por>?</por>
                <prevFileNumber>?</prevFileNumber>
                <processingComplete>?</processingComplete>
                <resubmission>?</resubmission>
                <rush>?</rush>
                <serviceId>?</serviceId>
                <submittedDtm>?</submittedDtm>
                <userAccess>
                    <accountId>?</accountId>
                    <clientId>?</clientId>
                    <privilegeCd>?</privilegeCd>
                </userAccess>
                <eNotification>?</eNotification>
            </efilingPackage>
        </cso:saveFiling>
    </soapenv:Body>
</soapenv:Envelope>